Revit 2027 API
ModelText.SetVisibility Method
Sets the visibility for the model text in a family document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetVisibility(
	FamilyElementVisibility visibility
)
Public Sub SetVisibility (
	visibility As FamilyElementVisibility
)
public:
void SetVisibility(
	FamilyElementVisibility^ visibility
)
member SetVisibility :
        visibility : FamilyElementVisibility -> unit
Parameters
visibility FamilyElementVisibility
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when visibility is null.
InvalidOperationException |  Thrown when regeneration failed, or the model curve is in a project document.
Remarks
The visibility of the model text geometry can be changed for different types of views and detail levels in the family document.
See Also
Reference
ModelText Class
Autodesk.Revit.DB Namespace